- A home renting startup, Ghar ki Baat, is planning to offer 2 BHK fully furnished flats for rent in Powai, Mumbai. In   order to ensure that it charges the correct rent, it wants to find the average rent charged by homeowners in Powai.

- For that purpose, it has acquired the following data, which has a list of 200 fully furnished 2 BHK flats in Powai,   along with the monthly rent charged for them in the year 2016.

In [1]:
# As a data analyst working for Ghar ki Baat, you are tasked with finding the average rent for
# all 2 BHK fully furnished flats in Powai, Mumbai, using this data.

import numpy as np
import pandas as pd
rent_df = pd.read_csv("Inferential Statistics - Powai Flats Rent.csv")

In [2]:
rent_df.head()

   S. No.  Monthly Rent
0       1         44000
1       2         49800
2       3         45400
3       4         40700
4       5         43900

In [7]:
#print("Average rent" , rent_df['Monthly Rent'].avg())
rent_df.describe()

           S. No.  Monthly Rent
count  200.000000    200.000000
mean   100.500000  45571.000000
std     57.879185   7457.521851
min      1.000000  30100.000000
25%     50.750000  41250.000000
50%    100.500000  44950.000000
75%    150.250000  49825.000000
max    200.000000  59800.000000